Tekla Open API Reference for Tekla Structures 2025
BaseComponent.SetAttribute Method
Overload List
Name | Description
SetAttribute(String, Double)
 Sets the attribute's value to the given value.
SetAttribute(String, Int32)
 Sets the attribute's value to the given value.
SetAttribute(String, String)
 Sets the attribute's value to the given value.
Top
See Also
Reference
BaseComponent Class
Tekla.Structures.Model Namespace